%% @copyright 2013 Takeru Ohta <phjgt308@gmail.com>
%%
%% @doc テスト用の何もしないエンティティプロセス
-module(do_nothing_entity).

%%--------------------------------------------------------------------------------
%% Exported API
%%--------------------------------------------------------------------------------
-export([start_link/0]).

%%--------------------------------------------------------------------------------
%% Exported Functions
%%--------------------------------------------------------------------------------
-spec start_link() -> {ok, pid()}.
start_link() ->
    {ok, spawn_link(fun () -> timer:sleep(infinity) end)}.

